[
  {
    "version": "0.3.12",
    "date": "2026-02-15",
    "changes": [
      "Base tab renamed to Empire; production breakdown and stats use Empire rate.",
      "Housing merged into Planets: build housing is now on each planet card (no separate Housing section)."
    ]
  },
  {
    "version": "0.3.11",
    "date": "2026-02-15",
    "changes": [
      "Planet type (rocky/desert/ice/volcanic/gas), colors, texture, rings/belt and size are now derived from the planet name instead of id; same name always gives the same look and affinity stats.",
      "Test coverage raised to ~99%: handlers excluded from coverage, new tests for planetAffinity, achievements, gameState, quests, research, SaveLoadService, and domain entities."
    ]
  },
  {
    "version": "0.3.10",
    "date": "2026-02-15",
    "changes": [
      "Planet names are now generated from a deterministic name generator (same planet id always gets the same name); no more fixed list so each run gets varied names."
    ]
  },
  {
    "version": "0.3.9",
    "date": "2026-02-15",
    "changes": [
      "Handlers split by domain (save, mine, upgrade, planet, quest, prestige, research, settings, debug) for easier maintenance.",
      "Chart drawing extracted to presentation/components/chartUtils.ts.",
      "Offline progress: soft cap after 12h (80% at 14h, 50% at 24h) instead of hard cap.",
      "i18n: first-time toasts, expedition messages, chart legends, and crew cost use strings.ts."
    ]
  },
  {
    "version": "0.3.8",
    "date": "2026-02-15",
    "changes": [
      "Upgrades tab: clearer card layout with tier-colored badge, production effect highlight, cost block, and improved count/crew badges."
    ]
  },
  {
    "version": "0.3.7",
    "date": "2026-02-15",
    "changes": [
      "UI refactor: reusable components (toasts, modals, gameplay blocks, button+tooltip, upgrade card) in presentation/components/ to avoid repeating the same DOM patterns."
    ]
  },
  {
    "version": "0.3.6",
    "date": "2026-02-15",
    "changes": [
      "Upgrade cost scales with how many you own: each extra copy costs 15% more (configurable in gameConfig).",
      "Upgrades tab shows only the first 5 upgrades (by tier) to keep the list short; later tiers still unlock as you progress."
    ]
  },
  {
    "version": "0.3.5",
    "date": "2026-02-15",
    "changes": [
      "Base/Planets: each planet tile now shows the same procedural planet sphere as in the Mine view."
    ]
  },
  {
    "version": "0.3.4",
    "date": "2026-02-15",
    "changes": [
      "Mining Robot no longer uses a planet slot; you can have as many as you want.",
      "Upgrades show slot cost (1 slot or No slot). Planet type affects production: each machine has affinity per planet type (Rocky, Desert, Ice, Volcanic, Gas). Info (i) on each upgrade shows production by planet type."
    ]
  },
  {
    "version": "0.3.3",
    "date": "2026-02-15",
    "changes": [
      "Cookie Clicker–style scale: upgrades 25 → 1K → 10K → 100K → 1M → 10M → 100M → 1B → 10B → 100B. Prestige at 1M, planets/crew/slots in the thousands–millions. Milestones and quests spread across 100 to 1e15."
    ]
  },
  {
    "version": "0.3.2",
    "date": "2026-02-15",
    "changes": [
      "Rebalanced prices and unlock thresholds for a smoother idle-game curve: first upgrade 25 ⬡ (was 100), 5× scaling per tier, crew/planets/quest/research/prestige unlocks aligned with progression. Prestige at 40K, daily bonus 10 ⬡, quest and milestone targets updated."
    ]
  },
  {
    "version": "0.3.1",
    "date": "2026-02-15",
    "changes": [
      "Full game adapted to extreme numbers: upgrade costs and production, planet/slot/housing/astronaut costs, prestige threshold, and save/load all use Decimal. Stats history and charts cap at Number.MAX_VALUE for display."
    ]
  },
  {
    "version": "0.3.0",
    "date": "2026-02-15",
    "changes": [
      "Big numbers: coins, production rate, and total coins ever can now grow beyond 1e308 (Cookie Clicker–style). Display uses K, M, B, T, Qa, Qi, … and scientific notation for huge values."
    ]
  },
  {
    "version": "0.2.1",
    "date": "2026-02-15",
    "changes": [
      "Random events are now unlocked by progression at 2,000 coins (intro modal + first event after a short delay)."
    ]
  },
  {
    "version": "0.2.0",
    "date": "2026-02-15",
    "changes": [
      "Data and logic refactor: game data moved to config files (upgrades, events, research, achievements, balance, progression, quest generation) in src/data/. Easier to tune and extend without touching code.",
      "Changelog and version: settings panel shows current version and what's new when an update is available."
    ]
  },
  {
    "version": "0.1.0",
    "date": "2026-01-15",
    "changes": [
      "Version and changelog: see if there's been an update and read what's new.",
      "Housing: build housing on planets to increase crew capacity (+2 astronauts per module).",
      "Expeditions: send astronauts on expeditions to discover new planets (risk of casualties).",
      "Research: skill tree for +% production and +% click; resets on Prestige.",
      "Quests, events, prestige, achievements, milestones.",
      "Settings: theme, sound, reduce motion, export/import save."
    ]
  }
]