[
  {
    "version": "0.5.14",
    "date": "2026-02",
    "changes": [
      "Narrator/ship log: one-off toasts on milestones (first 1M coins, first prestige, Legend achievement) from narrator.json; narratorShown persisted in save."
    ]
  },
  {
    "version": "0.5.13",
    "date": "2026-02",
    "changes": [
      "Event recurrence: less frequent defaults (5 min between events, 1 min first delay, 2 min after load); tests for recurrence constants."
    ]
  },
  {
    "version": "0.5.12",
    "date": "2026-02",
    "changes": [
      "Docs: Mermaid diagrams for layered architecture, upgrade-purchase flow, reactive UI flow (overview.md), and save/load data flow (save-format.md)."
    ]
  },
  {
    "version": "0.5.11",
    "date": "2026-02",
    "changes": [
      "Achievement flavor text: optional flavor/story per achievement (achievements.json); unlock toast shows name and flavor when present."
    ]
  },
  {
    "version": "0.5.10",
    "date": "2026-02",
    "changes": [
      "UI/UX: next-milestone progress bar in stats, subtle pulse on tab badges with action, achievement-unlock celebration flash, theme-aware accent border on gameplay blocks (reduced motion respected)."
    ]
  },
  {
    "version": "0.5.9",
    "date": "2026-02",
    "changes": [
      "Prestige chapters: lore titles and quotes per level (prestigeLore.json), shown on prestige confirm modal and on success toast."
    ]
  },
  {
    "version": "0.5.8",
    "date": "2026-02",
    "changes": [
      "Codex/Archive: unlockable lore entries in Stats; entries unlock from achievements, events seen, planets, prestige; codexUnlocks persisted in save."
    ]
  },
  {
    "version": "0.5.7",
    "date": "2026-02",
    "changes": [
      "Planet discovery log: first-contact flavor per planet type (discoveryFlavor.json), shown on expedition success toast and in planet detail; Discovery log section in Empire panel; flavor persisted in save."
    ]
  },
  {
    "version": "0.5.6",
    "date": "2026-02",
    "changes": [
      "Quest story hooks: one-line intros per quest type from questFlavor.json, shown above quest description on dashboard."
    ]
  },
  {
    "version": "0.5.5",
    "date": "2026-02",
    "changes": [
      "Event flavor text: optional flavor field in events data, shown in toasts when 'Event story toasts' setting is on; Settings toggle added."
    ]
  },
  {
    "version": "0.5.4",
    "date": "2026-02",
    "changes": [
      "Combo decay indicator: remaining time (e.g. 1.2s) next to combo; updates in real time from game loop."
    ]
  },
  {
    "version": "0.5.3",
    "date": "2026-02",
    "changes": [
      "Modules panel: \"Next recommended\" hint (cheapest/best production gain or first not owned) using existing catalog and dashboard helpers."
    ]
  },
  {
    "version": "0.5.2",
    "date": "2026-02",
    "changes": [
      "Tailwind CSS v4 integrated: @tailwindcss/vite, @theme design tokens (colors, fonts, radius), global styles in @layer base, layout and utilities in @layer components; base.css removed."
    ]
  },
  {
    "version": "0.5.1",
    "date": "2026-02",
    "changes": [
      "Events: first time an event type is seen, toast shows one-line effect plus optional lore (from i18n catalogs); event types seen tracked in save (discoveredEventIds)."
    ]
  },
  {
    "version": "0.5.0",
    "date": "2026-02",
    "changes": [
      "Migration to Vue.js"
    ]
  },
  {
    "version": "0.4.37",
    "date": "2026-02-17",
    "changes": [
      "Expedition modal: choose destination (easy/medium/hard) with 3D planet preview, planet name and type; pick crew composition by role; launch from modal.",
      "Expedition difficulty tiers: easy (lower risk, shorter), medium (standard), hard (higher risk, +1 slot on new planet); difficulty saved with in-progress expedition.",
      "Expedition modal UI: grid of destination cards, planet type badge, crew picker section, polished layout and responsive stacking on small screens.",
      "Renamed upgrades to Modules in UI (tab, hints, rules). Catalog moved to modules.json with 5 new modules: Solar Collector (desert), Cryo Extractor (ice), Magma Pump (volcanic), Gas Siphon (gas), Geo Drill (rocky). Module cards show Best on: planet type and (i) tooltip with production by planet type."
    ]
  },
  {
    "version": "0.4.36",
    "date": "2026-02-17",
    "changes": [
      "Uninstall loading: duration = install time / 2, progress bar and Cancel button (same look as install). Upgrade stays on planet and keeps producing until loading completes; cancel only removes the timer.",
      "Install and research progress: Cancel button on overlays; cancel install refunds coins and frees crew; cancel research refunds cost.",
      "Upgrade choose-planet modal: chip on each planet row showing count of this upgrade type installed (e.g. ×2)."
    ]
  },
  {
    "version": "0.4.35",
    "date": "2026-02",
    "changes": [
      "Interactive 3D planet detail: click a planet thumbnail in the Empire tab to open a modal with a full three.js scene — drag to rotate in all directions, scroll to zoom, seamless procedural texture on sphere.",
      "Beautiful 3D rings with shader (banding, transparency, noise), instanced asteroid belt, orbiting moons with procedural crater textures, fresnel atmosphere glow, starfield background.",
      "3D mine zone: the main spatial view is now a full three.js scene with textured planets, atmosphere, rings, belt, moons, star glow, orbit lines. 2D overlay for click particles and effects.",
      "3D planet thumbnails: planet cards in the Empire tab now render with a shared three.js renderer for consistent 3D look.",
      "Planet stats: type, system, production, slots, housing, crew, moons, features, installed upgrades list."
    ]
  },
  {
    "version": "0.4.34",
    "date": "2026-02-16",
    "changes": [
      "Batch DOM updates: notifyRefresh coalesces into requestAnimationFrame. Lazy load panels: upgrades, empire, research, dashboard, stats render only when first viewed.",
      "Code organization: domHelper→domUtils, generic builders, components barrel. Split mount (mountTabs, mountModals), strings (en/fr), dashboard (dashboardHelpers).",
      "Display: pause canvas when tab hidden; batch DOM reads in updateStats; will-change + contain on animated elements."
    ]
  },
  {
    "version": "0.4.33",
    "date": "2026-02-16",
    "changes": [
      "activeEventsStore, questStateStore observables. Game loop: runProductionTick, runPanelUpdates, runCanvasUpdates. getElement DOM helper. withErrorBoundary for refresh. performance.measure for refresh timing."
    ]
  },
  {
    "version": "0.4.32",
    "date": "2026-02-16",
    "changes": [
      "EventBus: wire domain events (upgrade_purchased, prestige, quest_claimed, planet_bought, astronaut_hired) to notifyRefresh. createThrottledRun for panel updates."
    ]
  },
  {
    "version": "0.4.31",
    "date": "2026-02-16",
    "changes": [
      "Observable migration: refresh now includes updateProgressionVisibility, updateTabMenuVisibility, updateTabVisibility, updateTabBadges for reactive tab/progression UI."
    ]
  },
  {
    "version": "0.4.30",
    "date": "2026-02-16",
    "changes": [
      "Observable migration: notifyRefresh in completeUpgradeInstallations, triggerRandomEvent. Refresh includes renderResearchSection, updateStatisticsSection. Removed redundant renderCrewSection/renderPrestigeSection from refresh (updateStats does them)."
    ]
  },
  {
    "version": "0.4.29",
    "date": "2026-02-16",
    "changes": [
      "Observable pattern: sessionStore, settingsStore, refreshSignal. Handlers emit notifyRefresh; UI subscribes reactively. Dashboard in refresh."
    ]
  },
  {
    "version": "0.4.27",
    "date": "2026-02-16",
    "changes": [
      "Research: success rate now shows effective chance (including scientist bonus). Added (+x% scientist) next to success rate when you have scientists."
    ]
  },
  {
    "version": "0.4.26",
    "date": "2026-02-16",
    "changes": [
      "Dashboard \"Do this next\": smarter recommendations. Only suggests upgrades you can actually buy (coins + slot + crew); uses unlocked research for slot/crew. Time-to-upgrade only when the blocker is coins (slot and crew OK). Recommends \"Add a slot\" or \"Hire astronauts\" when the next upgrade is blocked by slot or crew; \"Need X astronauts for expedition\" when you have coins but not enough crew. Skips research suggestion when research is already in progress."
    ]
  },
  {
    "version": "0.4.25",
    "date": "2026-02-16",
    "changes": [
      "Quests: coin and production targets are now capped at 10× your current value (e.g. at 710/s you get \"Reach 3,000/s\" instead of \"Reach 100,000/s\")."
    ]
  },
  {
    "version": "0.4.24",
    "date": "2026-02-16",
    "changes": [
      "Quests: smarter progression. Coin/production quests offer only the next 1–3 milestones (no more random huge jumps). Prestige-today quests appear only after you have prestiged at least once; astronaut quests only after crew is relevant (1.5k+ coins or some crew); event quests only after events are unlocked (120k). Upgrade quests limited to upgrades you can afford (scale with totalCoinsEver)."
    ]
  },
  {
    "version": "0.4.23",
    "date": "2026-02-16",
    "changes": [
      "Quests: progression-aware generation. Quests now scale with your state: e.g. \"Prestige 3 times today\" only appears after you have already prestiged twice today; coin/production targets are within reach; astronaut and event targets are the next steps. Difficulty increases logically instead of random impossible goals."
    ]
  },
  {
    "version": "0.4.22",
    "date": "2026-02-16",
    "changes": [
      "Achievements: new trophy button in header (next to info and settings) opens a dedicated Achievements modal with list and descriptions (hidden achievements show ??? until unlocked). New achievement: click a shooting star in the mine zone (Wish upon a star). Achievements removed from Settings modal."
    ]
  },
  {
    "version": "0.4.21",
    "date": "2026-02-16",
    "changes": [
      "UI: progress bar shimmer on quest, next event, and crew capacity; upgrade card flash on purchase; tab badges when quest claimable, prestige ready, or research available; empty states with icons for crew, planets, and upgrades; Settings grouped (Visual, Gameplay, Save & data); collapsible section summaries (e.g. \"5 crew\", \"3 planets\"); bottom nav (Mine | Empire) on small screens; larger tap targets on planet and upgrade cards."
    ]
  },
  {
    "version": "0.4.20",
    "date": "2026-02-16",
    "changes": [
      "Two new crew jobs: Medic (unlock via Basic Refining) and Engineer (unlock via Efficiency). Medics reduce expedition death chance by 2% each; Engineers give +0.8% production each."
    ]
  },
  {
    "version": "0.4.19",
    "date": "2026-02-16",
    "changes": [
      "Crew: you first hire Astronauts (no job). Unlock Miner, Scientist and Pilot via Research (Mining Theory, Survey Systems, Orbital Engineering) to hire specialists and get their bonuses."
    ]
  },
  {
    "version": "0.4.18",
    "date": "2026-02-16",
    "changes": [
      "Upgrades now have an installation delay (4s by default): production is applied when the module finishes installing. Planet cards show \"X installing\" while modules are in progress."
    ]
  },
  {
    "version": "0.4.17",
    "date": "2026-02-15",
    "changes": [
      "All planets use the full procedural texture algorithm: water bias, ridges, mountains (earth), type variation (desert/ice/lava/gas), cracks (ice), flows (lava), clouds. Richer palettes and seamless-X for future scroll."
    ]
  },
  {
    "version": "0.4.16",
    "date": "2026-02-15",
    "changes": [
      "Mine zone canvas: star corona pulse and rotating spikes; planet atmospheres (by type), moons (1–2 for some), size by orbit; planet trails and drifting dust; grid lines for multi-system; breathing zoom; center glow (single system); floating background particles."
    ]
  },
  {
    "version": "0.4.15",
    "date": "2026-02-15",
    "changes": [
      "Mine zone canvas visual polish: star twinkle, radial background and subtle nebula, planet halos and terminator shadow, readable planet labels with outline.",
      "Orbits: gradient (brighter near star), phase offset per system. Click ripple on mine, rare shooting stars, animated stripes for solar-flare/solar-wind/comet-tail events."
    ]
  },
  {
    "version": "0.4.14",
    "date": "2026-02-15",
    "changes": [
      "Planets section: collapse/expand by solar system. Each system (Alpha Centauri, Beta Ceti, etc.) has a header you can click to show or hide its planets."
    ]
  },
  {
    "version": "0.4.13",
    "date": "2026-02-15",
    "changes": [
      "Smarter \"Do this next\": recommends research when affordable and not in progress, expedition only when launchable, time-to-afford for expedition and next upgrade, and \"~X min to [upgrade]\" when mining."
    ]
  },
  {
    "version": "0.4.12",
    "date": "2026-02-15",
    "changes": [
      "Balance overhaul: longer, harder progression. Prestige at 5M (was 1M), +4% per level. Upgrades and research cost more; research success chances slightly lower late-game.",
      "New planet cost 120K (was 50K), expeditions longer and riskier. Crew, housing, slots cost more; bonuses tuned down. Combo/lucky slightly harder.",
      "More milestones and quest targets; new achievements (Scientist, Lab complete, Fleet, Tycoon, etc.). New event: Ion Storm. Negative events unlock after 4 triggers."
    ]
  },
  {
    "version": "0.4.11",
    "date": "2026-02-15",
    "changes": [
      "Solar systems have names (data in solarSystems.json). Planet display names show system: \"PlanetName (System Name)\" in list, upgrades, housing, and Mine view."
    ]
  },
  {
    "version": "0.4.10",
    "date": "2026-02-15",
    "changes": [
      "Dashboard: empire row now shows solar systems count, upgrades count, and research nodes (X/Y). Quest card shows quest description."
    ]
  },
  {
    "version": "0.4.9",
    "date": "2026-02-15",
    "changes": [
      "Crew section redesign: capacity bar, role cards (Miner / Scientist / Pilot) with count and effect per role, clearer summary line and veterans."
    ]
  },
  {
    "version": "0.4.8",
    "date": "2026-02-15",
    "changes": [
      "Dashboard: prestige progress bar (to Prestige threshold), empire at a glance (planets + crew), researching pill (click to open Research), stat icons, progress card styling, staggered card entrance animation (respects reduced motion).",
      "Keyboard shortcut hint (Space to mine · 1–6 switch tabs) is hidden on touch devices (smartphone)."
    ]
  },
  {
    "version": "0.4.7",
    "date": "2026-02-15",
    "changes": [
      "Dashboard overhaul: at-a-glance stats (coins, production rate, run summary), clearer recommended-action hero card, quest progress card with bar, live status pills (events, expedition, next event), shortcut pills with i18n. Improved UI/UX and mission-control styling."
    ]
  },
  {
    "version": "0.4.6",
    "date": "2026-02-15",
    "changes": [
      "Stats charts: each chart has a ? with a short description (tooltip). Two new charts — Clicks (per period) and Coins from clicks (per period). History now records clicks and coins-from-clicks per sample."
    ]
  },
  {
    "version": "0.4.5",
    "date": "2026-02-15",
    "changes": [
      "Dashboard tab (Tableau de bord): overview (coins, production, crew, planets, prestige), next milestone, active events, quest progress with claim, expedition status, and quick actions to jump to Mine, Empire, Upgrades, Research, Stats or Prestige.",
      "Stats tab: two new charts — Coins gained (per period) and Production (smoothed, 5-point moving average)."
    ]
  },
  {
    "version": "0.4.4",
    "date": "2026-02-15",
    "changes": [
      "Stats tab: new stats — Best combo (run), Avg coins/s (run), Prestiges today, Research nodes, Expedition status, Playing since, Peak production (chart)."
    ]
  },
  {
    "version": "0.4.3",
    "date": "2026-02-15",
    "changes": [
      "UI/UX: All tabs (Mine, Empire, Research, Upgrades, Stats) visible on mobile with horizontal scroll.",
      "Keyboard shortcut hint under Mine zone (Space to mine · 1–4 switch tabs).",
      "Mine zone hint visible by default, fades after first click or Space.",
      "Combo decay: time left (e.g. 1.2s) shown next to combo multiplier.",
      "Exact value tooltip on Coins and Production when compact numbers are on.",
      "Event badge countdown format: \"— 18s\" for active events.",
      "Prestige confirm modal: line \"After Prestige: level X → +Y% production forever.\"",
      "Offline recap toast shows hours away when applicable (e.g. \"You earned X coins while away (Y h).\").",
      "Border radius standardized (8/12/16px). Disabled buttons: cursor not-allowed, dimmed.",
      "Stats chart range (Recent/Long term) persisted in localStorage.",
      "Modals with long content: scrollable body, scrollbar-gutter. Touch targets min 44px. One-page layout: more spacing and borders between sections."
    ]
  },
  {
    "version": "0.4.2",
    "date": "2026-02-15",
    "changes": [
      "Expedition progress bar: finding a new planet now takes time (base + extra per planet already owned). A progress bar and countdown show during the expedition; outcome (success/fail, toasts) when it completes. Expedition state is saved so it continues after reload."
    ]
  },
  {
    "version": "0.4.1",
    "date": "2026-02-15",
    "changes": [
      "Events: better display (positive/negative badges with ×mult and time), clearer next-event progress with label, event-positive toast variant. First event after unlock triggers sooner (18s). Negative events unlock after 3 triggers in a run (positive-only at first)."
    ]
  },
  {
    "version": "0.4.0",
    "date": "2026-02-15",
    "changes": [
      "Crew system: hire by role (Miner, Scientist, Medic, Pilot). Miners +2% production each; others +1%. Scientists boost research success chance; medics reduce expedition death chance; pilots guarantee at least one survivor.",
      "Veterans: expedition survivors become veterans and give +0.5% production each (lost on Prestige).",
      "Morale: +5% production when crew ≤ capacity (enough housing); −5% when overcrowded.",
      "Save format: crewByRole and veteranCount in session; Planet.assignedCrew for future use. Old saves migrate automatically."
    ]
  },
  {
    "version": "0.3.15",
    "date": "2026-02-15",
    "changes": [
      "UI: overlay open/close unified in presentation/components/overlay (openOverlay, closeOverlay, isOverlayOpen, getOpenOverlayElement). All modals (settings, info, reset confirm, prestige confirm/rewards, intro) use the same pattern; focus trap uses getOpenOverlayElement()."
    ]
  },
  {
    "version": "0.3.14",
    "date": "2026-02-15",
    "changes": [
      "UI: notification logic unified into reusable components. Toasts use components/toasts (with TOAST_CONTAINER_ID); floating reward and floating coin use components/floatingFeedback with a single animation lifecycle."
    ]
  },
  {
    "version": "0.3.13",
    "date": "2026-02-15",
    "changes": [
      "Last saved indicator in Settings (Saved / Saved Xs ago), updated on save_success and when opening Settings.",
      "Secret achievements: Combo master, Speed run, Void walker show ??? until unlocked.",
      "New quest types: Prestige N times today, Reach ×N combo, Trigger N events this run, Own one of every tier-1 upgrade.",
      "Run stats (Stats tab): This run section with run duration, coins earned, quests claimed, events triggered since last prestige."
    ]
  },
  {
    "version": "0.3.12",
    "date": "2026-02-15",
    "changes": [
      "Base tab renamed to Empire; production breakdown and stats use Empire rate.",
      "Housing merged into Planets: build housing is now on each planet card (no separate Housing section)."
    ]
  },
  {
    "version": "0.3.11",
    "date": "2026-02-15",
    "changes": [
      "Planet type (rocky/desert/ice/volcanic/gas), colors, texture, rings/belt and size are now derived from the planet name instead of id; same name always gives the same look and affinity stats.",
      "Test coverage raised to ~99%: handlers excluded from coverage, new tests for planetAffinity, achievements, gameState, quests, research, SaveLoadService, and domain entities."
    ]
  },
  {
    "version": "0.3.10",
    "date": "2026-02-15",
    "changes": [
      "Planet names are now generated from a deterministic name generator (same planet id always gets the same name); no more fixed list so each run gets varied names."
    ]
  },
  {
    "version": "0.3.9",
    "date": "2026-02-15",
    "changes": [
      "Handlers split by domain (save, mine, upgrade, planet, quest, prestige, research, settings, debug) for easier maintenance.",
      "Chart drawing extracted to presentation/components/chartUtils.ts.",
      "Offline progress: soft cap after 12h (80% at 14h, 50% at 24h) instead of hard cap.",
      "i18n: first-time toasts, expedition messages, chart legends, and crew cost use strings.ts."
    ]
  },
  {
    "version": "0.3.8",
    "date": "2026-02-15",
    "changes": [
      "Upgrades tab: clearer card layout with tier-colored badge, production effect highlight, cost block, and improved count/crew badges."
    ]
  },
  {
    "version": "0.3.7",
    "date": "2026-02-15",
    "changes": [
      "UI refactor: reusable components (toasts, modals, gameplay blocks, button+tooltip, upgrade card) in presentation/components/ to avoid repeating the same DOM patterns."
    ]
  },
  {
    "version": "0.3.6",
    "date": "2026-02-15",
    "changes": [
      "Upgrade cost scales with how many you own: each extra copy costs 15% more (configurable in gameConfig).",
      "Upgrades tab shows only the first 5 upgrades (by tier) to keep the list short; later tiers still unlock as you progress."
    ]
  },
  {
    "version": "0.3.5",
    "date": "2026-02-15",
    "changes": [
      "Base/Planets: each planet tile now shows the same procedural planet sphere as in the Mine view."
    ]
  },
  {
    "version": "0.3.4",
    "date": "2026-02-15",
    "changes": [
      "Mining Robot no longer uses a planet slot; you can have as many as you want.",
      "Upgrades show slot cost (1 slot or No slot). Planet type affects production: each machine has affinity per planet type (Rocky, Desert, Ice, Volcanic, Gas). Info (i) on each upgrade shows production by planet type."
    ]
  },
  {
    "version": "0.3.3",
    "date": "2026-02-15",
    "changes": [
      "Cookie Clicker–style scale: upgrades 25 → 1K → 10K → 100K → 1M → 10M → 100M → 1B → 10B → 100B. Prestige at 1M, planets/crew/slots in the thousands–millions. Milestones and quests spread across 100 to 1e15."
    ]
  },
  {
    "version": "0.3.2",
    "date": "2026-02-15",
    "changes": [
      "Rebalanced prices and unlock thresholds for a smoother idle-game curve: first upgrade 25 ⬡ (was 100), 5× scaling per tier, crew/planets/quest/research/prestige unlocks aligned with progression. Prestige at 40K, daily bonus 10 ⬡, quest and milestone targets updated."
    ]
  },
  {
    "version": "0.3.1",
    "date": "2026-02-15",
    "changes": [
      "Full game adapted to extreme numbers: upgrade costs and production, planet/slot/housing/astronaut costs, prestige threshold, and save/load all use Decimal. Stats history and charts cap at Number.MAX_VALUE for display."
    ]
  },
  {
    "version": "0.3.0",
    "date": "2026-02-15",
    "changes": [
      "Big numbers: coins, production rate, and total coins ever can now grow beyond 1e308 (Cookie Clicker–style). Display uses K, M, B, T, Qa, Qi, … and scientific notation for huge values."
    ]
  },
  {
    "version": "0.2.1",
    "date": "2026-02-15",
    "changes": [
      "Random events are now unlocked by progression at 2,000 coins (intro modal + first event after a short delay)."
    ]
  },
  {
    "version": "0.2.0",
    "date": "2026-02-15",
    "changes": [
      "Data and logic refactor: game data moved to config files (upgrades, events, research, achievements, balance, progression, quest generation) in src/data/. Easier to tune and extend without touching code.",
      "Changelog and version: settings panel shows current version and what's new when an update is available."
    ]
  },
  {
    "version": "0.1.0",
    "date": "2026-01-15",
    "changes": [
      "Version and changelog: see if there's been an update and read what's new.",
      "Housing: build housing on planets to increase crew capacity (+2 astronauts per module).",
      "Expeditions: send astronauts on expeditions to discover new planets (risk of casualties).",
      "Research: skill tree for +% production and +% click; resets on Prestige.",
      "Quests, events, prestige, achievements, milestones.",
      "Settings: theme, sound, reduce motion, export/import save."
    ]
  }
]