[
  { "trigger": "coins_1m", "message": "Mission control: First million in the vault. The belt is taking notice." },
  { "trigger": "coins_500k", "message": "Ship log: Half a million credits. The balance sheet is starting to mean something." },
  { "trigger": "coins_10m", "message": "Comms: Ten million. Your ledger reads like legend in the making." },
  { "trigger": "first_prestige", "message": "Ship log: Rebirth protocol engaged. You are no longer the same miner who left port." },
  { "trigger": "first_upgrade", "message": "Comms: First module purchased. The turn from miner to operator has begun." },
  { "trigger": "first_planet", "message": "Mission control: First world discovered. The fleet is no longer grounded." },
  { "trigger": "first_astronaut", "message": "Ship log: First hire on the payroll. Someone has to watch the rigs." },
  { "trigger": "first_quest", "message": "Comms: First quest completed. The board has taken note." },
  { "trigger": "first_event", "message": "Ship log: Anomaly detected. The belt is not as quiet as it seems." },
  { "trigger": "first_expedition_launch", "message": "Mission control: Expedition launched. The void awaits." },
  { "trigger": "first_research_node", "message": "Comms: First node unlocked. The lab is open for business." },
  { "trigger": "first_daily_bonus", "message": "Ship log: Daily bonus credited. The rig rewards consistency." },
  { "trigger": "coins_25k", "message": "Comms: Twenty-five thousand in the vault. Early days, but the curve is real." },
  { "trigger": "coins_100k", "message": "Ship log: A hundred thousand. The balance sheet is no longer a joke." },
  { "trigger": "coins_1b", "message": "Mission control: One billion. The belt is yours in all but name." },
  { "trigger": "play_10min", "message": "Ship log: Ten minutes on the clock. The shift has barely started." },
  { "trigger": "play_30min", "message": "Comms: Thirty minutes logged. You are settling in." },
  { "trigger": "play_1h", "message": "Mission control: One hour in the belt. The rig knows your rhythm." },
  { "trigger": "play_2h", "message": "Ship log: Two hours. Half a shift. Keep the ore flowing." },
  { "trigger": "play_5h", "message": "Comms: Five hours. You have left a mark on the sector." },
  { "trigger": "play_10h", "message": "Mission control: Ten hours total. The logs will remember." },
  { "trigger": "play_24h", "message": "Ship log: Twenty-four hours in the void. You are no longer a visitor." },
  { "trigger": "achievement:first-click", "message": "Mission control: First tap logged. Every empire begins with one." },
  { "trigger": "achievement:clicks-100", "message": "Ship log: One hundred taps. The rig remembers every one." },
  { "trigger": "achievement:clicks-1k", "message": "Comms: A thousand clicks. The belt has felt your dedication." },
  { "trigger": "achievement:clicks-10k", "message": "Ship log: Ten thousand. The rig is becoming an extension of your will." },
  { "trigger": "achievement:clicks-50k", "message": "Mission control: Fifty thousand taps. The belt knows your name." },
  { "trigger": "achievement:clicks-100k", "message": "Comms: A hundred thousand. You are the storm." },
  { "trigger": "achievement:first-upgrade", "message": "Ship log: First module online. Production never sleeps." },
  { "trigger": "achievement:upgrades-10", "message": "Mission control: Ten modules. The operation scales." },
  { "trigger": "achievement:upgrades-25", "message": "Comms: Twenty-five modules. The operation runs like clockwork." },
  { "trigger": "achievement:upgrades-50", "message": "Ship log: Fifty modules. You are not just mining—you are the market." },
  { "trigger": "achievement:upgrades-100", "message": "Mission control: A hundred modules. The sector hums to your tune." },
  { "trigger": "achievement:first-astronaut", "message": "Comms: First hire. Someone has to watch the rigs." },
  { "trigger": "achievement:astronauts-5", "message": "Ship log: Five crew on the payroll. The fleet takes shape." },
  { "trigger": "achievement:astronauts-20", "message": "Mission control: Twenty astronauts. The void is no longer empty." },
  { "trigger": "achievement:first-prestige", "message": "Ship log: Rebirth. Not loss—shedding the old shell." },
  { "trigger": "achievement:prestige-5", "message": "Comms: Five cycles. You know the drill." },
  { "trigger": "achievement:prestige-10", "message": "Mission control: Your name is spoken in every port on the belt. Legend." },
  { "trigger": "achievement:prestige-15", "message": "Ship log: Fifteen rebirths. You are ascending." },
  { "trigger": "achievement:prestige-25", "message": "Comms: Twenty-five cycles. You are no longer just crossing the void—you are of it." },
  { "trigger": "achievement:planets-3", "message": "Mission control: Three worlds. The achievement is logged. So is the cost." },
  { "trigger": "achievement:planets-10", "message": "Ship log: Ten worlds under one banner. The belt has felt your presence." },
  { "trigger": "achievement:coins-50k", "message": "Comms: Fifty thousand earned. The balance sheet starts to mean something." },
  { "trigger": "achievement:coins-500k", "message": "Ship log: Half a million. The belt pays its dues." },
  { "trigger": "achievement:coins-10m", "message": "Mission control: Ten million. Your vault could fill a small moon." },
  { "trigger": "achievement:coins-1b", "message": "Comms: A billion. The belt is yours in all but name." },
  { "trigger": "achievement:first-quest", "message": "Ship log: The board posted. You delivered." },
  { "trigger": "achievement:quest-streak-3", "message": "Mission control: Three in a row. The board learns to expect your name." },
  { "trigger": "achievement:research-5", "message": "Comms: Five nodes. The lab opens doors the mine never could." },
  { "trigger": "achievement:research-10", "message": "Ship log: Ten nodes. The belt yields more than ore." },
  { "trigger": "achievement:research-15", "message": "Mission control: Fifteen nodes. You are the lab." },
  { "trigger": "achievement:research-20", "message": "Comms: Twenty nodes. You run the lab; the lab runs the numbers." },
  { "trigger": "achievement:research-full", "message": "Ship log: Every node unlocked. The science is done. The mine is forever changed." },
  { "trigger": "achievement:combo-master", "message": "Mission control: You chained the hits. The rig rewarded the rhythm." },
  { "trigger": "achievement:first-slot", "message": "Comms: More slots than the starter rig. You built room to grow." },
  { "trigger": "achievement:speed-run", "message": "Ship log: Two million, fast. The belt noticed." },
  { "trigger": "achievement:shooting-star", "message": "Mission control: You caught a shooting star. Some say it brings luck. The logs say you were there." },
  { "trigger": "first_negative_event", "message": "Ship log: First negative anomaly. The belt does not always reward." },
  { "trigger": "first_gas_giant", "message": "Mission control: First gas giant charted. The fleet has reached the giants." },
  { "trigger": "first_lost_expedition", "message": "Comms: Expedition lost. The void takes its due. Honour them." },
  { "trigger": "first_expedition_casualties", "message": "Ship log: Mission success, but the void took its share. First blood on the ledger." },
  { "trigger": "first_slot_added", "message": "Comms: First slot expansion. That world can carry more rigs now." },
  { "trigger": "first_housing", "message": "Mission control: First housing built. The crew has a place to rest." },
  { "trigger": "first_set_bonus", "message": "Ship log: Module set bonus active. Same-type rigs on one world amplify output." },
  { "trigger": "set_bonus_3", "message": "Comms: Three set bonuses online. The fleet is starting to synergize." },
  { "trigger": "set_bonus_5", "message": "Mission control: Five set bonuses. Your rigs are talking to each other." },
  { "trigger": "set_bonus_10", "message": "Ship log: Ten set bonuses across the belt. You have become a set collector." },
  { "trigger": "set_bonus_15pct", "message": "Comms: Set bonuses now add 15% to output. The numbers don't lie." },
  { "trigger": "set_bonus_30pct", "message": "Mission control: Thirty percent from set bonuses alone. The operation has found its rhythm." },
  { "trigger": "set_bonus_50pct", "message": "Ship log: Fifty percent bonus from sets. You have mastered the art of the stack." }
]
