[
  {"id":"welcome","coinsThreshold":0,"title":"Welcome to Stellar Miner","body":"Click the asteroid (or press Space) to mine coins. Your goal: grow your mining operation by buying upgrades, hiring crew, and expanding to new planets. Your first planet has 6 slots: you can place at most 6 upgrades (robots, drills, etc.) until you add more slots or discover new planets. Mine until you can afford your first upgrade (25 ⬡).","sectionId":null},
  {"id":"upgrades","coinsThreshold":15,"title":"Upgrades","body":"Spend coins to buy equipment that produces coins automatically. Each upgrade adds production per second. You have a limited number of slots per planet (6 on your first planet): each robot or drill uses one slot, so you can place at most 6 upgrades there until you add slots or discover new planets. Start with a Mining Robot (25 ⬡), then scale up to thousands, millions, and beyond.","sectionId":"upgrades-section"},
  {"id":"crew","coinsThreshold":800,"title":"Crew","body":"Hire astronauts to boost your production (+2% per astronaut). Better upgrades require crew to operate—you spend astronauts when you buy those upgrades. Hire your first astronaut at 1,000 ⬡.","sectionId":"crew-section"},
  {"id":"research","coinsThreshold":5000,"title":"Scientific Research","body":"Skill tree: attempt to unlock nodes for +% production and +% click. Each attempt can succeed or fail (coins lost on failure). Resets on Prestige.","sectionId":"research-section"},
  {"id":"planets","coinsThreshold":50000,"title":"Planets","body":"Send astronauts on expeditions to discover new planets (+5% production each). Some may die during the mission; if all die, the planet is not discovered. First expedition: 50,000 ⬡. You can also add slots to existing planets.","sectionId":"planets-section"},
  {"id":"events","coinsThreshold":50000,"title":"Random events","body":"Space is full of surprises. Random events will now occasionally boost or reduce your production for a short time. Watch the event badges and plan around them!","sectionId":null},
  {"id":"quest","coinsThreshold":100000,"title":"Quests","body":"Complete quests for bonus coins and rewards. Each quest has a target (e.g. mine X coins, buy upgrades). Claim within 5 minutes of completion for a streak bonus. Check the Quest section above.","sectionId":"quest-section"},
  {"id":"prestige","coinsThreshold":1000000,"title":"Prestige","body":"When you reach 1,000,000 coins you can Prestige: reset coins and planets to gain +5% production per prestige level forever. Use it to progress faster on each new run and climb the K → M → B curve.","sectionId":"prestige-section"}
]
